---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TextBackground
source: html/ca4dc12c-e5a6-d51a-b7af-fd5ac47b4f67.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TextBackground Property

"Background"

## Syntax (C#)
```csharp
public static ForgeTypeId TextBackground { get; }
```